; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-12)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph2 - mode
	infrared0 - mode
	infrared1 - mode
	spectrograph4 - mode
	infrared3 - mode
	Star0 - direction
	Star3 - direction
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Star19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Star22 - direction
	Star23 - direction
	Phenomenon24 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet16)
	(supports instrument3 infrared0)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared0)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star15)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star4)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon6)
	(supports instrument7 infrared1)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star2)
	(supports instrument8 infrared0)
	(supports instrument8 infrared3)
	(supports instrument8 spectrograph4)
	(calibration_target instrument8 Star2)
	(supports instrument9 infrared3)
	(supports instrument9 spectrograph4)
	(supports instrument9 infrared1)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star14)
)
(:goal (and
	(have_image Planet5 infrared0)
	(have_image Phenomenon6 spectrograph4)
	(have_image Star7 infrared0)
	(have_image Planet8 infrared1)
	(have_image Star9 spectrograph4)
	(have_image Planet10 thermograph2)
	(have_image Planet11 infrared3)
	(have_image Phenomenon13 spectrograph4)
	(have_image Star14 thermograph2)
	(have_image Star15 infrared3)
	(have_image Planet16 infrared1)
	(have_image Phenomenon17 spectrograph4)
	(have_image Star18 spectrograph4)
	(have_image Star19 thermograph2)
	(have_image Planet20 thermograph2)
	(have_image Phenomenon21 thermograph2)
	(have_image Star22 infrared1)
	(have_image Star23 spectrograph4)
	(have_image Phenomenon24 infrared0)
))

)

; plan
1. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 19
2. (calibrate satellite1 instrument4 star4)
   added: (calibrated instrument4)
   goals met: 0 of 19
3. (turn_to satellite1 planet5 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 planet5)
   goals met: 0 of 19
4. (take_image satellite1 planet5 instrument4 infrared0)
   added: (have_image planet5 infrared0)
   goals met: 1 of 19
5. (turn_to satellite1 star7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star7)
   goals met: 1 of 19
6. (take_image satellite1 star7 instrument4 infrared0)
   added: (have_image star7 infrared0)
   goals met: 2 of 19
7. (turn_to satellite1 planet10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet10)
   goals met: 2 of 19
8. (take_image satellite1 planet10 instrument4 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 3 of 19
9. (turn_to satellite1 planet11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet11)
   goals met: 3 of 19
10. (take_image satellite1 planet11 instrument4 infrared3)
   added: (have_image planet11 infrared3)
   goals met: 4 of 19
11. (turn_to satellite1 star14 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star14)
   goals met: 4 of 19
12. (take_image satellite1 star14 instrument4 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 5 of 19
13. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 5 of 19
14. (take_image satellite1 star15 instrument4 infrared3)
   added: (have_image star15 infrared3)
   goals met: 6 of 19
15. (turn_to satellite1 star19 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star19)
   goals met: 6 of 19
16. (take_image satellite1 star19 instrument4 thermograph2)
   added: (have_image star19 thermograph2)
   goals met: 7 of 19
17. (turn_to satellite1 planet20 star19)
   deleted: (pointing satellite1 star19)
   added: (pointing satellite1 planet20)
   goals met: 7 of 19
18. (take_image satellite1 planet20 instrument4 thermograph2)
   added: (have_image planet20 thermograph2)
   goals met: 8 of 19
19. (turn_to satellite1 phenomenon21 planet20)
   deleted: (pointing satellite1 planet20)
   added: (pointing satellite1 phenomenon21)
   goals met: 8 of 19
20. (take_image satellite1 phenomenon21 instrument4 thermograph2)
   added: (have_image phenomenon21 thermograph2)
   goals met: 9 of 19
21. (turn_to satellite1 phenomenon24 phenomenon21)
   deleted: (pointing satellite1 phenomenon21)
   added: (pointing satellite1 phenomenon24)
   goals met: 9 of 19
22. (take_image satellite1 phenomenon24 instrument4 infrared0)
   added: (have_image phenomenon24 infrared0)
   goals met: 10 of 19
23. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 10 of 19
24. (turn_to satellite0 star0 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star0)
   goals met: 10 of 19
25. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 10 of 19
26. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 10 of 19
27. (take_image satellite0 phenomenon6 instrument0 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 11 of 19
28. (turn_to satellite0 planet8 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 planet8)
   goals met: 11 of 19
29. (take_image satellite0 planet8 instrument0 infrared1)
   added: (have_image planet8 infrared1)
   goals met: 12 of 19
30. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 12 of 19
31. (take_image satellite0 star9 instrument0 spectrograph4)
   added: (have_image star9 spectrograph4)
   goals met: 13 of 19
32. (turn_to satellite0 phenomenon13 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 phenomenon13)
   goals met: 13 of 19
33. (take_image satellite0 phenomenon13 instrument0 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 14 of 19
34. (turn_to satellite0 planet16 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet16)
   goals met: 14 of 19
35. (take_image satellite0 planet16 instrument0 infrared1)
   added: (have_image planet16 infrared1)
   goals met: 15 of 19
36. (turn_to satellite0 phenomenon17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 phenomenon17)
   goals met: 15 of 19
37. (take_image satellite0 phenomenon17 instrument0 spectrograph4)
   added: (have_image phenomenon17 spectrograph4)
   goals met: 16 of 19
38. (turn_to satellite0 star18 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 star18)
   goals met: 16 of 19
39. (take_image satellite0 star18 instrument0 spectrograph4)
   added: (have_image star18 spectrograph4)
   goals met: 17 of 19
40. (turn_to satellite0 star22 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star22)
   goals met: 17 of 19
41. (take_image satellite0 star22 instrument0 infrared1)
   added: (have_image star22 infrared1)
   goals met: 18 of 19
42. (turn_to satellite0 star23 star22)
   deleted: (pointing satellite0 star22)
   added: (pointing satellite0 star23)
   goals met: 18 of 19
43. (take_image satellite0 star23 instrument0 spectrograph4)
   added: (have_image star23 spectrograph4)
   goals met: 19 of 19
